Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.141/PIC32CM-LS60/include/pio/pic32cm2532ls60100.h
#define PIN_PA22B_PTC_Y16                          _UL_(22)    
#define MUX_PA22B_PTC_Y16                          _UL_(1)     
#define PINMUX_PA22B_PTC_Y16                       ((PIN_PA22B_PTC_Y16 << 16) | MUX_PA22B_PTC_Y16)
#define PORT_PA22B_PTC_Y16                         (_UL_(1) << 22)

#define PIN_PA23B_PTC_Y17                          _UL_(23)    
#define MUX_PA23B_PTC_Y17                          _UL_(1)     
#define PINMUX_PA23B_PTC_Y17                       ((PIN_PA23B_PTC_Y17 << 16) | MUX_PA23B_PTC_Y17)
#define PORT_PA23B_PTC_Y17                         (_UL_(1) << 23)

#define PIN_PA30B_PTC_Y18                          _UL_(30)    
#define MUX_PA30B_PTC_Y18                          _UL_(1)     
#define PINMUX_PA30B_PTC_Y18                       ((PIN_PA30B_PTC_Y18 << 16) | MUX_PA30B_PTC_Y18)
#define PORT_PA30B_PTC_Y18                         (_UL_(1) << 30)

#define PIN_PA31B_PTC_Y19                          _UL_(31)    
#define MUX_PA31B_PTC_Y19                          _UL_(1)     
#define PINMUX_PA31B_PTC_Y19                       ((PIN_PA31B_PTC_Y19 << 16) | MUX_PA31B_PTC_Y19)
#define PORT_PA31B_PTC_Y19                         (_UL_(1) << 31)

#define PIN_PB08B_PTC_Y20                          _UL_(40)    
#define MUX_PB08B_PTC_Y20                          _UL_(1)     
#define PINMUX_PB08B_PTC_Y20                       ((PIN_PB08B_PTC_Y20 << 16) | MUX_PB08B_PTC_Y20)
#define PORT_PB08B_PTC_Y20                         (_UL_(1) << 8)

#define PIN_PB09B_PTC_Y21                          _UL_(41)    
#define MUX_PB09B_PTC_Y21                          _UL_(1)     
#define PINMUX_PB09B_PTC_Y21                       ((PIN_PB09B_PTC_Y21 << 16) | MUX_PB09B_PTC_Y21)
#define PORT_PB09B_PTC_Y21                         (_UL_(1) << 9)

#define PIN_PA20B_PTC_Y22                          _UL_(20)    
#define MUX_PA20B_PTC_Y22                          _UL_(1)     
#define PINMUX_PA20B_PTC_Y22                       ((PIN_PA20B_PTC_Y22 << 16) | MUX_PA20B_PTC_Y22)
#define PORT_PA20B_PTC_Y22                         (_UL_(1) << 20)

#define PIN_PA21B_PTC_Y23                          _UL_(21)    
#define MUX_PA21B_PTC_Y23                          _UL_(1)     
#define PINMUX_PA21B_PTC_Y23                       ((PIN_PA21B_PTC_Y23 << 16) | MUX_PA21B_PTC_Y23)
#define PORT_PA21B_PTC_Y23                         (_UL_(1) << 21)

#define PIN_PA12B_PTC_Y24                          _UL_(12)    
#define MUX_PA12B_PTC_Y24                          _UL_(1)     
#define PINMUX_PA12B_PTC_Y24                       ((PIN_PA12B_PTC_Y24 << 16) | MUX_PA12B_PTC_Y24)
#define PORT_PA12B_PTC_Y24                         (_UL_(1) << 12)

#define PIN_PA13B_PTC_Y25                          _UL_(13)    
#define MUX_PA13B_PTC_Y25                          _UL_(1)     
#define PINMUX_PA13B_PTC_Y25                       ((PIN_PA13B_PTC_Y25 << 16) | MUX_PA13B_PTC_Y25)
#define PORT_PA13B_PTC_Y25                         (_UL_(1) << 13)

#define PIN_PB04B_PTC_Y26                          _UL_(36)    
#define MUX_PB04B_PTC_Y26                          _UL_(1)     
#define PINMUX_PB04B_PTC_Y26                       ((PIN_PB04B_PTC_Y26 << 16) | MUX_PB04B_PTC_Y26)
#define PORT_PB04B_PTC_Y26                         (_UL_(1) << 4)

#define PIN_PB05B_PTC_Y27                          _UL_(37)    
#define MUX_PB05B_PTC_Y27                          _UL_(1)     
#define PINMUX_PB05B_PTC_Y27                       ((PIN_PB05B_PTC_Y27 << 16) | MUX_PB05B_PTC_Y27)
#define PORT_PB05B_PTC_Y27                         (_UL_(1) << 5)

#define PIN_PB06B_PTC_Y28                          _UL_(38)    
#define MUX_PB06B_PTC_Y28                          _UL_(1)     
#define PINMUX_PB06B_PTC_Y28                       ((PIN_PB06B_PTC_Y28 << 16) | MUX_PB06B_PTC_Y28)
#define PORT_PB06B_PTC_Y28                         (_UL_(1) << 6)

#define PIN_PB07B_PTC_Y29                          _UL_(39)    
#define MUX_PB07B_PTC_Y29                          _UL_(1)     
#define PINMUX_PB07B_PTC_Y29                       ((PIN_PB07B_PTC_Y29 << 16) | MUX_PB07B_PTC_Y29)
#define PORT_PB07B_PTC_Y29                         (_UL_(1) << 7)

#define PIN_PB12B_PTC_Y30                          _UL_(44)    
#define MUX_PB12B_PTC_Y30                          _UL_(1)     
#define PINMUX_PB12B_PTC_Y30                       ((PIN_PB12B_PTC_Y30 << 16) | MUX_PB12B_PTC_Y30)
#define PORT_PB12B_PTC_Y30                         (_UL_(1) << 12)

#define PIN_PB13B_PTC_Y31                          _UL_(45)    
#define MUX_PB13B_PTC_Y31                          _UL_(1)     
#define PINMUX_PB13B_PTC_Y31                       ((PIN_PB13B_PTC_Y31 << 16) | MUX_PB13B_PTC_Y31)
#define PORT_PB13B_PTC_Y31                         (_UL_(1) << 13)

/* ========== PORT definition for RTC peripheral ========== */
#define PIN_PA08G_RTC_IN0                          _UL_(8)     
#define MUX_PA08G_RTC_IN0                          _UL_(6)     
#define PINMUX_PA08G_RTC_IN0                       ((PIN_PA08G_RTC_IN0 << 16) | MUX_PA08G_RTC_IN0)
#define PORT_PA08G_RTC_IN0                         (_UL_(1) << 8)

#define PIN_PA09G_RTC_IN1                          _UL_(9)     
#define MUX_PA09G_RTC_IN1                          _UL_(6)     
#define PINMUX_PA09G_RTC_IN1                       ((PIN_PA09G_RTC_IN1 << 16) | MUX_PA09G_RTC_IN1)
#define PORT_PA09G_RTC_IN1                         (_UL_(1) << 9)

#define PIN_PA16G_RTC_IN2                          _UL_(16)    
#define MUX_PA16G_RTC_IN2                          _UL_(6)     
#define PINMUX_PA16G_RTC_IN2                       ((PIN_PA16G_RTC_IN2 << 16) | MUX_PA16G_RTC_IN2)
#define PORT_PA16G_RTC_IN2                         (_UL_(1) << 16)

#define PIN_PA17G_RTC_IN3                          _UL_(17)    
#define MUX_PA17G_RTC_IN3                          _UL_(6)     
#define PINMUX_PA17G_RTC_IN3                       ((PIN_PA17G_RTC_IN3 << 16) | MUX_PA17G_RTC_IN3)
#define PORT_PA17G_RTC_IN3                         (_UL_(1) << 17)

#define PIN_PB14G_RTC_IN4                          _UL_(46)    
#define MUX_PB14G_RTC_IN4                          _UL_(6)     
#define PINMUX_PB14G_RTC_IN4                       ((PIN_PB14G_RTC_IN4 << 16) | MUX_PB14G_RTC_IN4)
#define PORT_PB14G_RTC_IN4                         (_UL_(1) << 14)

