Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.141/PIC32CM-LS60/include/pio/pic32cm2532ls60100.h
#define PIN_PA15J_TCC0_WO5                         _UL_(15)    
#define MUX_PA15J_TCC0_WO5                         _UL_(9)     
#define PINMUX_PA15J_TCC0_WO5                      ((PIN_PA15J_TCC0_WO5 << 16) | MUX_PA15J_TCC0_WO5)
#define PORT_PA15J_TCC0_WO5                        (_UL_(1) << 15)

#define PIN_PA23J_TCC0_WO5                         _UL_(23)    
#define MUX_PA23J_TCC0_WO5                         _UL_(9)     
#define PINMUX_PA23J_TCC0_WO5                      ((PIN_PA23J_TCC0_WO5 << 16) | MUX_PA23J_TCC0_WO5)
#define PORT_PA23J_TCC0_WO5                        (_UL_(1) << 23)

#define PIN_PB17J_TCC0_WO5                         _UL_(49)    
#define MUX_PB17J_TCC0_WO5                         _UL_(9)     
#define PINMUX_PB17J_TCC0_WO5                      ((PIN_PB17J_TCC0_WO5 << 16) | MUX_PB17J_TCC0_WO5)
#define PORT_PB17J_TCC0_WO5                        (_UL_(1) << 17)

#define PIN_PA12J_TCC0_WO6                         _UL_(12)    
#define MUX_PA12J_TCC0_WO6                         _UL_(9)     
#define PINMUX_PA12J_TCC0_WO6                      ((PIN_PA12J_TCC0_WO6 << 16) | MUX_PA12J_TCC0_WO6)
#define PORT_PA12J_TCC0_WO6                        (_UL_(1) << 12)

#define PIN_PA16J_TCC0_WO6                         _UL_(16)    
#define MUX_PA16J_TCC0_WO6                         _UL_(9)     
#define PINMUX_PA16J_TCC0_WO6                      ((PIN_PA16J_TCC0_WO6 << 16) | MUX_PA16J_TCC0_WO6)
#define PORT_PA16J_TCC0_WO6                        (_UL_(1) << 16)

#define PIN_PA20J_TCC0_WO6                         _UL_(20)    
#define MUX_PA20J_TCC0_WO6                         _UL_(9)     
#define PINMUX_PA20J_TCC0_WO6                      ((PIN_PA20J_TCC0_WO6 << 16) | MUX_PA20J_TCC0_WO6)
#define PORT_PA20J_TCC0_WO6                        (_UL_(1) << 20)

#define PIN_PB12J_TCC0_WO6                         _UL_(44)    
#define MUX_PB12J_TCC0_WO6                         _UL_(9)     
#define PINMUX_PB12J_TCC0_WO6                      ((PIN_PB12J_TCC0_WO6 << 16) | MUX_PB12J_TCC0_WO6)
#define PORT_PB12J_TCC0_WO6                        (_UL_(1) << 12)

#define PIN_PA13J_TCC0_WO7                         _UL_(13)    
#define MUX_PA13J_TCC0_WO7                         _UL_(9)     
#define PINMUX_PA13J_TCC0_WO7                      ((PIN_PA13J_TCC0_WO7 << 16) | MUX_PA13J_TCC0_WO7)
#define PORT_PA13J_TCC0_WO7                        (_UL_(1) << 13)

#define PIN_PA17J_TCC0_WO7                         _UL_(17)    
#define MUX_PA17J_TCC0_WO7                         _UL_(9)     
#define PINMUX_PA17J_TCC0_WO7                      ((PIN_PA17J_TCC0_WO7 << 16) | MUX_PA17J_TCC0_WO7)
#define PORT_PA17J_TCC0_WO7                        (_UL_(1) << 17)

#define PIN_PA21J_TCC0_WO7                         _UL_(21)    
#define MUX_PA21J_TCC0_WO7                         _UL_(9)     
#define PINMUX_PA21J_TCC0_WO7                      ((PIN_PA21J_TCC0_WO7 << 16) | MUX_PA21J_TCC0_WO7)
#define PORT_PA21J_TCC0_WO7                        (_UL_(1) << 21)

#define PIN_PB13J_TCC0_WO7                         _UL_(45)    
#define MUX_PB13J_TCC0_WO7                         _UL_(9)     
#define PINMUX_PB13J_TCC0_WO7                      ((PIN_PB13J_TCC0_WO7 << 16) | MUX_PB13J_TCC0_WO7)
#define PORT_PB13J_TCC0_WO7                        (_UL_(1) << 13)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PA06E_TCC1_WO0                         _UL_(6)     
#define MUX_PA06E_TCC1_WO0                         _UL_(4)     
#define PINMUX_PA06E_TCC1_WO0                      ((PIN_PA06E_TCC1_WO0 << 16) | MUX_PA06E_TCC1_WO0)
#define PORT_PA06E_TCC1_WO0                        (_UL_(1) << 6)

#define PIN_PA10E_TCC1_WO0                         _UL_(10)    
#define MUX_PA10E_TCC1_WO0                         _UL_(4)     
#define PINMUX_PA10E_TCC1_WO0                      ((PIN_PA10E_TCC1_WO0 << 16) | MUX_PA10E_TCC1_WO0)
#define PORT_PA10E_TCC1_WO0                        (_UL_(1) << 10)

#define PIN_PA30E_TCC1_WO0                         _UL_(30)    
#define MUX_PA30E_TCC1_WO0                         _UL_(4)     
#define PINMUX_PA30E_TCC1_WO0                      ((PIN_PA30E_TCC1_WO0 << 16) | MUX_PA30E_TCC1_WO0)
#define PORT_PA30E_TCC1_WO0                        (_UL_(1) << 30)

#define PIN_PA07E_TCC1_WO1                         _UL_(7)     
#define MUX_PA07E_TCC1_WO1                         _UL_(4)     
#define PINMUX_PA07E_TCC1_WO1                      ((PIN_PA07E_TCC1_WO1 << 16) | MUX_PA07E_TCC1_WO1)
#define PORT_PA07E_TCC1_WO1                        (_UL_(1) << 7)

#define PIN_PA11E_TCC1_WO1                         _UL_(11)    
#define MUX_PA11E_TCC1_WO1                         _UL_(4)     
#define PINMUX_PA11E_TCC1_WO1                      ((PIN_PA11E_TCC1_WO1 << 16) | MUX_PA11E_TCC1_WO1)
#define PORT_PA11E_TCC1_WO1                        (_UL_(1) << 11)

#define PIN_PA31E_TCC1_WO1                         _UL_(31)    
#define MUX_PA31E_TCC1_WO1                         _UL_(4)     
#define PINMUX_PA31E_TCC1_WO1                      ((PIN_PA31E_TCC1_WO1 << 16) | MUX_PA31E_TCC1_WO1)
#define PORT_PA31E_TCC1_WO1                        (_UL_(1) << 31)

#define PIN_PA08J_TCC1_WO2                         _UL_(8)     
#define MUX_PA08J_TCC1_WO2                         _UL_(9)     
#define PINMUX_PA08J_TCC1_WO2                      ((PIN_PA08J_TCC1_WO2 << 16) | MUX_PA08J_TCC1_WO2)
#define PORT_PA08J_TCC1_WO2                        (_UL_(1) << 8)

#define PIN_PA24J_TCC1_WO2                         _UL_(24)    
#define MUX_PA24J_TCC1_WO2                         _UL_(9)     
#define PINMUX_PA24J_TCC1_WO2                      ((PIN_PA24J_TCC1_WO2 << 16) | MUX_PA24J_TCC1_WO2)
#define PORT_PA24J_TCC1_WO2                        (_UL_(1) << 24)

#define PIN_PB30J_TCC1_WO2                         _UL_(62)    
#define MUX_PB30J_TCC1_WO2                         _UL_(9)     
#define PINMUX_PB30J_TCC1_WO2                      ((PIN_PB30J_TCC1_WO2 << 16) | MUX_PB30J_TCC1_WO2)
#define PORT_PB30J_TCC1_WO2                        (_UL_(1) << 30)

#define PIN_PA09J_TCC1_WO3                         _UL_(9)     
#define MUX_PA09J_TCC1_WO3                         _UL_(9)     
#define PINMUX_PA09J_TCC1_WO3                      ((PIN_PA09J_TCC1_WO3 << 16) | MUX_PA09J_TCC1_WO3)
#define PORT_PA09J_TCC1_WO3                        (_UL_(1) << 9)

#define PIN_PA25J_TCC1_WO3                         _UL_(25)    
#define MUX_PA25J_TCC1_WO3                         _UL_(9)     
#define PINMUX_PA25J_TCC1_WO3                      ((PIN_PA25J_TCC1_WO3 << 16) | MUX_PA25J_TCC1_WO3)
#define PORT_PA25J_TCC1_WO3                        (_UL_(1) << 25)

#define PIN_PB31J_TCC1_WO3                         _UL_(63)    
#define MUX_PB31J_TCC1_WO3                         _UL_(9)     
#define PINMUX_PB31J_TCC1_WO3                      ((PIN_PB31J_TCC1_WO3 << 16) | MUX_PB31J_TCC1_WO3)
#define PORT_PB31J_TCC1_WO3                        (_UL_(1) << 31)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PA12E_TCC2_WO0                         _UL_(12)    
#define MUX_PA12E_TCC2_WO0                         _UL_(4)     
#define PINMUX_PA12E_TCC2_WO0                      ((PIN_PA12E_TCC2_WO0 << 16) | MUX_PA12E_TCC2_WO0)
#define PORT_PA12E_TCC2_WO0                        (_UL_(1) << 12)

#define PIN_PA16E_TCC2_WO0                         _UL_(16)    
#define MUX_PA16E_TCC2_WO0                         _UL_(4)     
#define PINMUX_PA16E_TCC2_WO0                      ((PIN_PA16E_TCC2_WO0 << 16) | MUX_PA16E_TCC2_WO0)
#define PORT_PA16E_TCC2_WO0                        (_UL_(1) << 16)

#define PIN_PA00E_TCC2_WO0                         _UL_(0)     
#define MUX_PA00E_TCC2_WO0                         _UL_(4)     
#define PINMUX_PA00E_TCC2_WO0                      ((PIN_PA00E_TCC2_WO0 << 16) | MUX_PA00E_TCC2_WO0)
#define PORT_PA00E_TCC2_WO0                        (_UL_(1) << 0)

